kyyang28/stm32_freertos_tasks/src/quad/target/12c-RTOS_TASKS/main.c

#include "target.h"
#include "system_stm32f4xx.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_gpio.h"
#include "misc.h"
#include "nvic.h"
#include "system.h"
#include "led.h"
#include "sound_beeper.h"
#include "config.h"
#include "configMaster.h"
#include "config_eeprom.h"
#include "exti.h"
#include "button.h"
#include "serial.h"
//#include "msp_serial.h"
//#include "printf.h"
#include "gps.h"
#include "rxSerial1Test.h"
#include "rxSerial3Test.h"
#include "rxSerial6Test.h"
#include <stdio.h>
#include "bus_i2c.h"
#include "bitband_i2c_soft.h"					// self-implemented i2c protocol
#include "bus_spi.h"
#include "initialisation.h"
#include "accgyro_spi_mpu9250.h"
#include "gyro.h"
#include "acceleration.h"
#include "maths.h"

//#include "mpu6050.h"
//#include "mpu6050_soft_i2c.h"					// for MPU6050 testing purposes
#include "mpu9250_soft_i2c.h"					// for MPU9250 testing purposes
//#include "inv_mpu.h"							// for MPU6050/MPU9250 DMP testing purposes
//#include "inv_mpu_dmp_motion_driver.h"			// for MPU6050/MPU9250 DMP testing purposes

#include "pwm_output.h"			// including timer.h ledTimer.h
#include "rx_pwm.h"
#include "rx.h"
#include "feature.h"

#include "time.h"				// allow to use timeUs_t which is uint32_t
#include "fc_core.h"
#include "fc_tasks.h"

#include "mixer.h"

#include "debug.h"

#include "sdcard.h"
#include "asyncfatfs.h"

#include "blackbox.h"
#include "blackbox_io.h"

#ifdef USE_RTOS
/* FreeRTOS */
#include "FreeRTOS.h"
#include "task.h"
#endif

//#define GPIO_PA1_PIN				PA1
//#define GPIO_PB8_PIN				PB8

//uint32_t counter = 0;

//uint32_t currentTimeUs;

//uint32_t base = 1;
//uint32_t sub = 2;			// build = 0x00000050
//uint32_t build;
//uint32_t tmp1, tmp2, tmp3, tmp4, tmp5, tmp6, tmp7, tmp8;

//uint8_t __g_basepri_save, __g_basepri_save2, __g_basepri_save3;
//uint8_t __g_ToDo, __g_ToDo2;
//uint8_t __basepriRestoreMem_inter;
//uint8_t basepri_val;
//int forCnt = 0;

//static IO_t g_scl;
//static IO_t g_sda;

#ifdef USE_RTOS

/* +------------------------------------------------------------------------------------------+ */
/* +--------------------------------------- FreeRTOS ------------------------------------------ */
/* +------------------------------------------------------------------------------------------+ */

#define START_TASK_PRIO                             1               // task priority
#define START_STK_SIZE                              256             // task stack size
TaskHandle_t StartTask_Handler;                             // task handler
void start_task(void *pvParameters);                        // task callback function

#define KEY_TASK_PRIO                               2
#define KEY_STK_SIZE                                256
TaskHandle_t KeyTask_Handler;
void key_task(void *pvParameters);

#define TASK1_TASK_PRIO                             3
#define TASK1_STK_SIZE                              256
TaskHandle_t Task1Task_Handler;
void task1_task(void *pvParameters);

#define TASK2_TASK_PRIO                             4
#define TASK2_STK_SIZE                              256
TaskHandle_t Task2Task_Handler;
void task2_task(void *pvParameters);

/* +------------------------------------------------------------------------------------------+ */
/* +--------------------------------------- FreeRTOS ------------------------------------------ */
/* +------------------------------------------------------------------------------------------+ */

#endif

typedef enum {
	SYSTEM_STATE_INITIALISING			= 0,
	SYSTEM_STATE_CONFIG_LOADED			= (1 << 0),
	SYSTEM_STATE_SENSORS_READY			= (1 << 1),
	SYSTEM_STATE_MOTORS_READY			= (1 << 2),
	SYSTEM_STATE_TRANSPONDER_ENABLED	= (1 << 3),
	SYSTEM_STATE_ALL_READY				= (1 << 7)
}systemState_e;

//int g_val = 0;

uint8_t systemState = SYSTEM_STATE_INITIALISING;
//IO_t PA1_PIN, PB8_PIN;


void systemInit(void);
//void gpioPA1Init(void);
//void gpioPA1Ops(void);
//void gpioPB8Init(void);
//void gpioPB8Ops(void);

//int i_cnt = 0;
//double f_cnt = 0.0;

#if 1
struct __FILE
{
    int dummy;
};

FILE __stdout;

int fputc(int ch, FILE *f)
{
    /* Send byte to USART */
//	gpsWrite(ch);
//	rxSerial1TestWrite(ch);
	rxSerial3TestWrite(ch);
//	rxSerial6TestWrite(ch);
    
    /* If everything is OK, you have to return character written */
    return ch;
    /* If character is not correct, you can return EOF (-1) to stop writing */
    //return -1;
}
#else
#ifdef __GNUC__
	#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
	#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif

PUTCHAR_PROTOTYPE
{
	rxSerial3TestWrite(ch);
	return ch;
}
#endif

//static IO_t mpuSpi9250CsPin = IO_NONE;

//bool sdaFlag = false;

//uint32_t TIM_ARR = 0;
//int16_t ledDutyCycle[LED_NUMBER];

//extern uint8_t TIM_CAPTURE_STATUS;			// status of timer input capture

extern uint8_t motorControlEnable;

#ifdef USE_RTOS
extern button_t button;
void key_task(void *pvParameters)
{
    bool flag = false;
    while (1) {
        if (button.dev.btnPressed) {
            delay(20);                  // debounce
            button.dev.btnPressed = false;
            if (!flag) {
                flag = true;
                vTaskSuspend(Task1Task_Handler);
                printf("Suspend Task1!\r\n");
            } else {
                flag = false;
                vTaskResume(Task1Task_Handler);
                printf("Resume Task1!\r\n");
            }
        }
        
        vTaskDelay(1000);
    }
}

void task1_task(void *pvParameters)
{
    uint32_t task1_counter = 0;
    
    while (1) {
        task1_counter++;
        LedToggle(LED4_NUM);
        printf("Task1 is executed %d times.\r\n", task1_counter);
        vTaskDelay(1000);
    }
}

void task2_task(void *pvParameters)
{
    uint32_t task2_counter = 0;
    
    while (1) {
        task2_counter++;
        LedToggle(LED5_NUM);
        printf("Task2 is executed %d times.\r\n", task2_counter);
        vTaskDelay(1000);
    }
}

