kyyang28/stm32_freertos_tasks/src/quad/target/12c-RTOS_TASKS/main.c
void start_task(void *pvParameters)
{
    taskENTER_CRITICAL();

    /* Create Key task */
    xTaskCreate((TaskFunction_t         )key_task,
                (const char *           )"key_task",
                (uint16_t               )KEY_STK_SIZE,
                (void *                 )NULL,
                (UBaseType_t            )KEY_TASK_PRIO,
                (TaskHandle_t *         )&KeyTask_Handler);
    
    /* Create Task1 task */
    xTaskCreate((TaskFunction_t         )task1_task,
                (const char *           )"task1_task",
                (uint16_t               )TASK1_STK_SIZE,
                (void *                 )NULL,
                (UBaseType_t            )TASK1_TASK_PRIO,
                (TaskHandle_t *         )&Task1Task_Handler);

    /* Create Task2 task */
    xTaskCreate((TaskFunction_t         )task2_task,
                (const char *           )"task2_task",
                (uint16_t               )TASK2_STK_SIZE,
                (void *                 )NULL,
                (UBaseType_t            )TASK2_TASK_PRIO,
                (TaskHandle_t *         )&Task2Task_Handler);
                
    vTaskDelete(StartTask_Handler);
    
    taskEXIT_CRITICAL();
}

void TimerInitForFreeRTOS(TIM_TypeDef *tim, uint16_t period, uint8_t khz, uint8_t irqNum, uint8_t premptPrio, uint8_t subPrio)
{
    /* Configure TIMER 4 */
    configTimeBaseKhz(tim, period, khz);
    
    TIM_ITConfig(tim, TIM_IT_Update, ENABLE);      // Allow TIM4 updating interrupts
    TIM_Cmd(tim, ENABLE);                          // Enable TIMER 4
    
    timerNVICConfigure4FreeRTOS(irqNum, premptPrio, subPrio);    
}
#endif

int main(void)
{
//	printfSupportInit();
	
	systemInit();
	
	/* Initialise IO (needed for all IO operations) */
	IOGlobalInit();
	
	/* Initialise EEPROM */
	initEEPROM();
	
	/* Check if EEPROM contains valid data */
	checkEEPROMContainsValidData();

	/* Initialise serial port usage list */
	serialInit(SerialConfig());

	/* Initialise debugging serial port */
//	rxSerial1TestInit();
	rxSerial3TestInit();
//	rxSerial6TestInit();

	/* Write masterConfig info into FLASH EEPROM
	 *
	 * TODO: (ISSUE) After calling writeEEPROM() function, the program will not be running when STM32F4 board is powered on
	 */
//	writeEEPROM();	// TODO: writeEEPROM() should be included inside the checkEEPROMContainsValidData() function
					//       separated here just for using printf (serialInit and rxSerial3TestInit initialised before writeEEPROM() and readEEPROM())

	/* Read masterConfig info from FLASH EEPROM */
	readEEPROM();

	/* Initialise MSP (MCU Support Package) serial */
//	mspSerialInit();

	/* IMPORTANT: the printf is functional only if the rxSerial3TestInit() function is initialised
	 * i.e., use printf debugger thereafter
	 */

//	printf("masterConfig.version: %u, %d\r\n", masterConfig.version, __LINE__);
//	printf("masterConfig.size: %u, %d\r\n", masterConfig.size, __LINE__);
//	printf("masterConfig.magic_be: 0x%x, %d\r\n", masterConfig.magic_be, __LINE__);
//	printf("masterConfig.magic_ef: 0x%x, %d\r\n", masterConfig.magic_ef, __LINE__);
//	printf("masterConfig.chk: %u, %d\r\n", masterConfig.chk, __LINE__);

//	gpsInit();	
//	gpsSetPrintfSerialPort();

	/* LedTimerConfig()->ioTags[xxx] initialisation done correctly */
//	printf("LedTimerConfig()->ioTags[0]: 0x%x\r\n", LedTimerConfig()->ioTags[0]);	// LED4, PD12, ioTag_t 0x4C
//	printf("LedTimerConfig()->ioTags[1]: 0x%x\r\n", LedTimerConfig()->ioTags[1]);	// LED3, PD13, ioTag_t 0x4D
//	printf("LedTimerConfig()->ioTags[2]: 0x%x\r\n", LedTimerConfig()->ioTags[2]);	// LED5, PD14, ioTag_t 0x4E
//	printf("LedTimerConfig()->ioTags[3]: 0x%x\r\n", LedTimerConfig()->ioTags[3]);	// LED6, PD15, ioTag_t 0x4F
	
	/* PwmConfig()->ioTags[xxx] initialisation done correctly */
//	printf("PwmConfig()->ioTags[0]: 0x%x\r\n", PwmConfig()->ioTags[0]);
//	printf("PwmConfig()->ioTags[1]: 0x%x\r\n", PwmConfig()->ioTags[1]);
//	printf("PwmConfig()->ioTags[2]: 0x%x\r\n", PwmConfig()->ioTags[2]);
//	printf("PwmConfig()->ioTags[3]: 0x%x\r\n", PwmConfig()->ioTags[3]);
//	printf("PwmConfig()->ioTags[4]: 0x%x\r\n", PwmConfig()->ioTags[4]);
//	printf("PwmConfig()->ioTags[5]: 0x%x\r\n", PwmConfig()->ioTags[5]);
//	printf("PwmConfig()->ioTags[6]: 0x%x\r\n", PwmConfig()->ioTags[6]);
//	printf("PwmConfig()->ioTags[7]: 0x%x\r\n", PwmConfig()->ioTags[7]);

	/* Read the contents of EEPROM */
//	ReadEEPROM();
	
	systemState |= SYSTEM_STATE_CONFIG_LOADED;
	
	debugMode = masterConfig.debug_mode;
	
	/* IMPORTANT: 
	 * 		DO NOT FORGET TO CALL latchActiveFeatures() function to perform the following action
	 *			activeFeaturesLatch = masterConfig.enabledFeatures
	 * Latch active features to be used for feature() in the remainder of init()
	 */
	latchActiveFeatures();
//	printf("masterConfig.enabledFeatures: 0x%x, %s, %d\r\n", masterConfig.enabledFeatures, __FUNCTION__, __LINE__);		// 0x2000 (1 << 13) FEATURE_RX_PARALLEL_PWM
	
	/* Initialise leds */
	LedInit(LedStatusConfig());
	
	/* Initialise external interrupt */
	EXTIInit();
	
	/* allow configuration to settle */
//	delay(100);
	
//	LedSet(LED3_NUM, true);		// LED3_NUM = 0
//	LedSet(LED4_NUM, true);		// LED4_NUM = 1
//	LedSet(LED5_NUM, true);		// LED5_NUM = 2
//	LedSet(LED6_NUM, true);		// LED6_NUM = 3

//	LED3_ON;
//	LED4_ON;
//	LED5_ON;
//	LED6_ON;

//	userBtnPollInit();
	
	/* Initialisae button with interrupt */
	buttonInit();

	/* Timer must be initialised before any channel is allocated
     *
     * Enable TIMERS.
     */
	timerInit();					// reinitialise the LED IO configuration to timer AF_PP if USE_LEDTIMER has been set.
									// INFO: To use NORMAL LEDs, turn off the USE_LEDTIMER micro in target.h

#ifdef USE_RTOS
    /* Initialise TIM4 */
    uint16_t period = 10000;
    uint8_t pscKhz = 10;
    uint8_t TIM3PremptPriority = 0x04;
    
    /* TIM4 interrupt will be disabled when calling portDISABLE_INTERRUPTS() as configMAX_SYSCALL_INTERRUPT_PRIORITY set to 5
     * All interrupt priorities greater than 5 will be disabled by calling portDISABLE_INTERRUPTS()
     */
    uint8_t TIM4PremptPriority = 0x05;
    uint8_t SubPriority = 0x00;
    
