kyyang28/stm32_freertos_tasks/src/quad/target/12c-RTOS_TASKS/main.c
    TimerInitForFreeRTOS(TIM3, period, pscKhz, TIM3_IRQn, TIM3PremptPriority, SubPriority);
    TimerInitForFreeRTOS(TIM4, period, pscKhz, TIM4_IRQn, TIM4PremptPriority, SubPriority);
#endif

#if defined(USE_LEDTIMER)
//	uint16_t idlePulse = LedTimerConfig()->mincommand;
	uint16_t idlePulse = 0;
#if 0
//	uint32_t KhzGain = 50;
	uint32_t KhzGain = 500;
//	printf("idlePulse: %u, %s, %d\r\n", idlePulse, __FUNCTION__, __LINE__);		// idlePulse = 1000 (mincommand)

	ledTimerKhzInit(LedTimerConfig(), idlePulse, LED_NUMBER, KhzGain);
	
	TIM_ARR = 10 * KhzGain;	// KhzGain = 500, TIM_ARR = 10*500 = 5000 (5000 / 10000 = 0.5s = 500ms)
	
//	printf("TIM_ARR: %u\r\n", TIM_ARR);
	
	ledDutyCycle[0] = TIM_ARR * 0.75;		// TIM4 CH1 LED4 PD12
	ledDutyCycle[1] = TIM_ARR * 0.50;		// TIM4 CH2 LED3 PD13
	ledDutyCycle[2] = TIM_ARR * 0.25;		// TIM4 CH3 LED5 PD14
	ledDutyCycle[3] = TIM_ARR * 0.20;		// TIM4 CH4 LED6 PD15
	
	for (int i = 0; i < LED_NUMBER; i++) {
		pwmWriteLed(i, ledDutyCycle[i]);
	}
#else
//	ledTimerMhzInit(LedTimerConfig(), idlePulse, LED_NUMBER);
#endif
#endif
    
#if 0
    /* Disable the following codes to NOT using TIMER functionalities */

	/* Initialise the ESC endpoints */
	mixerInit(MixerConfig()->mixerMode, masterConfig.customMotorMixer);
	
	/* Configurate the quadcopter mixer */
	mixerConfigurationOutput();				// motorCount = QUAD_MOTOR_COUNT, reset disarmed motor output to mincommand(1000)
	
	uint16_t bldcMotoridlePulse = MotorConfig()->mincommand;
	motorInit(MotorConfig(), bldcMotoridlePulse, getMotorCount());
#endif
	
#if defined(USE_PWM)			// USE_PWM is defined in target.h
//	printf("%s, %d\r\n", __FUNCTION__, __LINE__);
	if (feature(FEATURE_RX_PARALLEL_PWM)) {
//		printf("%s, %d\r\n", __FUNCTION__, __LINE__);
		pwmRxInit(PwmConfig());
	}
	
//	IO_t pwmIO = IOGetByTag(PwmConfig()->ioTags[0]);					// IOGetByTag() converts ioTag_t to IO_t
//	printf("IO_GPIO(pwmIO): 0x%x\r\n", (uint32_t)IO_GPIO(pwmIO));		// gpio = 0x40020000 (GPIOA)
//	printf("IO_Pin(pwmIO): %u\r\n", IO_Pin(pwmIO));						// pin = 1 = 0x1 (1 << 0)
#endif

	/* Testing USER button (PA0) high voltage level time period using TIM5 Input Capture mode */
//	TIM5_CH1_Cap_Init(0xFFFFFFFF, 84 - 1);	// 1MHz counter frequency, period (ARR) = 0xFFFFFFFF, psc = 84 - 1 = 83 (1MHz, 1us)
////	TIM5_CH1_Cap_Init(0x10000, 84 - 1);	// 1MHz counter frequency, period (ARR) = 0x10000, psc = 84 - 1 = 83 (1MHz, 1us), 0x10000 is not a proper value to measure the user button high voltage level
	
	/* +--------- TIMER LED TESTING PURPOSES ONLY ---------+ */
//	board_leds_init();
//	timer_clock_init();
//	timer_pwm_init();
//	timer_start();
////	flash_green_led_forever();
	/* +--------- TIMER LED TESTING PURPOSES ONLY ---------+ */

#ifdef USE_SPI			// USE_SPI is defined in target.h
	#ifdef USE_SPI_DEVICE_1
//		printf("%s, %d\r\n", __FUNCTION__, __LINE__);
		spiInit(SPIDEV_1);		// SPIDEV_1 = 0
	#endif
	#ifdef USE_SPI_DEVICE_2
//		printf("%s, %d\r\n", __FUNCTION__, __LINE__);
		spiInit(SPIDEV_2);
	#endif
#endif

#ifdef BEEPER
	beeperInit(BeeperConfig());
#endif

#ifdef USE_I2C			// USE_I2C is defined in target.h
	/* Initialise I2C device */
	i2cInit(I2C_DEVICE);
#endif

#if 0
//	IIC_Init();
#endif
	
//	g_scl = IOGetByTag(IO_TAG(SOFT_I2C_SCL));				// PB10
//	g_sda = IOGetByTag(IO_TAG(SOFT_I2C_SDA));				// PB11
//	ioRec_t *ioRecSDA = IO_Rec(g_sda);
//	printf("IO_GPIO(g_scl): 0x%x\r\n", (uint32_t)IO_GPIO(g_scl));		// gpio = 0x40021000 (GPIOE)
//	printf("IO_Pin(g_scl): %u\r\n", IO_Pin(g_scl));					// pin = 16 = 0x10 (1 << 4)
//	printf("IO_GPIO(g_sda): 0x%x\r\n", (uint32_t)IO_GPIO(g_sda));		// gpio = 0x40021000 (GPIOE)
//	printf("IO_Pin(g_sda): %u\r\n", IO_Pin(g_sda));					// pin = 16 = 0x10 (1 << 4)
	
//	IOConfigGPIO(g_scl, IOCFG_OUT_PP);
//	IOConfigGPIO(g_sda, IOCFG_OUT_PP);
//	IOConfigGPIO(g_scl, IOCFG_OUT_OD);
//	IOConfigGPIO(g_sda, IOCFG_OUT_OD);

//#define YELLOW_LED		PE4
//	IO_t yellowLedPin = IO_NONE;
//	yellowLedPin = IOGetByTag(IO_TAG(YELLOW_LED));
//	IOInit(yellowLedPin, OWNER_LED, 0);
//	IOConfigGPIO(yellowLedPin, IOCFG_OUT_PP);

//	mpuSpi9250CsPin = IOGetByTag(IO_TAG(MPU9250_CS_PIN));
	
//	ioRec_t *ioRecMPUSpi9250Cs = IO_Rec(IOGetByTag(IO_TAG(MPU9250_CS_PIN)));
//	printf("ioRecMPUSpi9250Cs->gpio: 0x%x\r\n", (uint32_t)ioRecMPUSpi9250Cs->gpio);		// gpio = 0x40021000 (GPIOE)
//	printf("ioRecMPUSpi9250Cs->pin: %u\r\n", ioRecMPUSpi9250Cs->pin);					// pin = 16 = 0x10 (1 << 4)

//	IOInit(mpuSpi9250CsPin, OWNER_MPU_CS, 0);

//	printf("ioRecMPUSpi9250Cs->owner: %u\r\n", ioRecMPUSpi9250Cs->owner);				// owner = 11
//	printf("ioRecMPUSpi9250Cs->index: %u\r\n", ioRecMPUSpi9250Cs->index);				// index = 0
//	printf("%s, %d\r\n", __FUNCTION__, __LINE__);		// ok
//	printf("IO_GPIOPortIdx(mpuSpi9250CsPin): %d\r\n", IO_GPIOPortIdx(mpuSpi9250CsPin));		// IO_GPIOPortIdx(mpuSpi9250CsPin) = 4
//	printf("DEFIO_IO_USED_COUNT: %d\r\n", DEFIO_IO_USED_COUNT);		// DEFIO_IO_USED_COUNT = 80
//	IOConfigGPIO(mpuSpi9250CsPin, SPI_IO_CS_CFG);
//	printf("%s, %d\r\n", __FUNCTION__, __LINE__);		// ok

#if 0
	short gyro_x, gyro_y, gyro_z;
	short acc_x, acc_y, acc_z;
	float temp = 0.0;
	float roll, pitch, yaw;				// Euler angles
#endif
	
#if 0
	uint8_t res = MPU_Init();
	printf("MPU_Init result: %u, %s, %d\r\n", res, __FUNCTION__, __LINE__);
#endif

#if 0
	while (mpu_dmp_init()) {
		printf("MPU6050 initialisation error!, %s, %d\r\n", __FUNCTION__, __LINE__);
		delay(200);
	}
	
	printf("MPU6050 initialisation is done using mpu_dmp_init @%s, %d\r\n", __FUNCTION__, __LINE__);
#endif

#if 0
	if (!MPU6050_Soft_I2C_Init()) {
		printf("MPU6050 initialisation is done @%s, %d\r\n", __FUNCTION__, __LINE__);
	}else {
		printf("Failed to initialise MPU6050 @%s, %d\r\n", __FUNCTION__, __LINE__);
		return -1;
	}
#endif

#if 0
	if (!MPU9250_Soft_I2C_Init()) {
		printf("MPU9250 initialisation is done @%s, %d\r\n", __FUNCTION__, __LINE__);
	}else {
		printf("Failed to initialise MPU9250 @%s, %d\r\n", __FUNCTION__, __LINE__);
		return -1;
	}
#endif
	
//	bool flag = false;

