kyyang28/stm32_freertos_tasks/src/quad/target/12c-RTOS_TASKS/main.c
#if defined(USE_IMU)			// USE_IMU is defined in target.h
	if (!sensorsAutodetect(GyroConfig(), AccelerometerConfig())) {
		//failureMode();
		printf("Failed to initialise IMU!, %s, %d\r\n", __FUNCTION__, __LINE__);
		while (1) {
			/* BLUE LED */
			LED6_ON;
			delay(100);
			LED6_OFF;
			delay(100);
		}
	}
#endif
	
	systemState |= SYSTEM_STATE_SENSORS_READY;
	
//	printf("Setup completed!\r\n");
	
//	gpioPA1Init();
//	gpioPB8Init();


#if defined(BEEPER)
	/* Board power on beeper */
	for (int i = 0; i < 10; i++) {
		delay(25);
		BEEP_ON;
		delay(25);
		BEEP_OFF;
	}
#endif
	
//	delay(3000);

	/* Testing standard deviation functions */
//	stdev_t var;
//	float dataset[] = {727.7, 1086.5, 1091.0, 1361.3, 1490.5, 1956.1};
//	devClear(&var);
//	for (int i = 0; i < sizeof(dataset)/sizeof(dataset[0]); i++) {
//		devPush(&var, dataset[i]);
//	}
//	float dev = devStandardDeviation(&var);
//	printf("dev: %f, %s, %d\r\n", dev, __FUNCTION__, __LINE__);					// 420.962463
//	printf("devint: %ld, %s, %d\r\n", lrintf(dev), __FUNCTION__, __LINE__);		// 421

	/* Initialise RX receiver */
	rxInit(RxConfig(), ModeActivationProfile()->modeActivationConditions);

#if 0
#ifdef USE_SDCARD
	if (feature(FEATURE_SDCARD) && BlackboxConfig()->device == BLACKBOX_SDCARD) {
//		printf("USE_SDCARD, %s, %d\r\n", __FUNCTION__, __LINE__);
		sdcardInsertionDetectInit();
		sdcard_init(SdcardConfig()->useDma);		// SdcardConfig()->useDma = false for now, use DMA later
		afatfs_init();
//		if (!sdcard_isInserted()) {
//			printf("SDCARD is not present!\r\n");
//		}else {
//			printf("SDCARD is present!\r\n");
//		}
	}
#endif
#endif

#if 0
#ifdef BLACKBOX
	initBlackbox();
#endif
#endif

#if defined(USE_IMU)
	/* set gyro calibration cycles */
	gyroSetCalibrationCycles();
#endif

//	const timeUs_t currentTimeUsAfter = micros();
//	printf("currentTimeUsAfter processRx: %u, %s, %d\r\n", currentTimeUsAfter, __FUNCTION__, __LINE__);

	/* Set the motorControlEnable flag to be TRUE to control the motors */
	motorControlEnable = true;

	uint16_t ledpwmval = 1500;
	uint8_t dir = 1;
	
//	printf("sizeof(master_t): %u\r\n", sizeof(master_t));			// sizeof(master_t): 868 so far


#ifdef USE_RTOS

/* +------------------------------------------------------------------------------------------+ */
/* +--------------------------------------- FreeRTOS ------------------------------------------ */
/* +------------------------------------------------------------------------------------------+ */

/* UBaseType_t = unsigned long */
    /* Create Start task */
    xTaskCreate((TaskFunction_t         )start_task,
                (const char *           )"start_task",
                (uint16_t               )START_STK_SIZE,
                (void *                 )NULL,
                (UBaseType_t            )START_TASK_PRIO,
                (TaskHandle_t *         )&StartTask_Handler);
                
    vTaskStartScheduler();                                          // Start FreeRTOS scheduler

/* +------------------------------------------------------------------------------------------+ */
/* +--------------------------------------- FreeRTOS ------------------------------------------ */
/* +------------------------------------------------------------------------------------------+ */
#else
	/* Main loop */
	while (1) {

//		delay(10);

//		if (dir) {
//			ledpwmval++;
//		}else {
//			ledpwmval--;
//		}
//		
//		if (ledpwmval > 2000) {
//			dir = 0;
//		}
//		
//		if (ledpwmval == 0) {
//			dir = 1;
//		}

//		for (int i = 0; i < getMotorCount(); i++) {
//			pwmWriteMotor(i, ledpwmval);
//		}
//		
////		for (int i = 0; i < LED_NUMBER; i++) {
////			pwmWriteLed(i, ledpwmval);
////		}
				
#if 0
		const timeUs_t currentTimeUs = micros();
//		printf("currentTimeUs before processRx: %u, %s, %d\r\n", currentTimeUs, __FUNCTION__, __LINE__);
		
//		rxSignalReceived = rxSignalReceivedNotDataDriven;		// rxSignalReceivedNotDataDriven initial false
//		rxIsInFailsafeMode = rxIsInFailsafeModeNotDataDriven;	// rxIsInFailsafeModeNotDataDriven initial true
		
		/* TODO: rxUpdateCheck() function will be running in a separate RTOS task */
		rxUpdateCheck(currentTimeUs, 0);			// update the rxSignalReceivedNotDataDriven, rxIsInFailsafeModeNotDataDriven, rxSignalReceived and rxIsInFailsafeMode
	
		taskUpdateRxMain(currentTimeUs);		// calling processRx(), updateRcCommands()
//		processRx(currentTimeUs);		// processRx function is called inside the taskUpdateRxMain function
		
		taskMainPidLoop(currentTimeUs);
		
		delay(20);				// taskUpdateRxMain() update period = 20 ms (20000 us = 50 Hz)
#endif
		
#ifdef BEEPER
//		BEEP_ON;		// turn beeper on
//		delay(200);
//		BEEP_OFF;		// turn beeper off
//		delay(200);

        for (int i = 0; i < 10; i++) {
    //		LED3_TOGGLE;
    //		LED4_TOGGLE;
            delay(25);
            BEEP_ON;
            delay(25);
            BEEP_OFF;
        }
        delay(2000);
#endif
		
//		gyroUpdate();													// read gyro data
//		delay(100);
#if defined(USE_IMU)		// USE_IMU is defined in target.h
		gyroUpdate();													// read gyro data
//		accUpdate(&AccelerometerConfig()->accelerometerTrims);			// read acc data
		if (gyro.dev.mpuDetectionResult.sensor == MPU_60x0 && gyro.dev.calibrationFlag) {
//			printf("MPU6050 data - gyroADCRaw[X]: %d, gyroADCRaw[Y]: %d, gyroADCRaw[Z]: %d, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyro.dev.gyroADCRaw[X], gyro.dev.gyroADCRaw[Y], gyro.dev.gyroADCRaw[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
//			printf("MPU6050 data - gyroADCCali[X]: %d, gyroADCCali[Y]: %d, gyroADCCali[Z]: %d, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyroADC[X], gyroADC[Y], gyroADC[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
//		}else if (gyro.dev.mpuDetectionResult.sensor == MPU_9250_I2C) {
		}else if (gyro.dev.mpuDetectionResult.sensor == MPU_9250_I2C && gyro.dev.calibrationFlag) {
			printf("MPU9250 (I2C) data - gyroADCRaw[X]: %d, gyroADCRaw[Y]: %d, gyroADCRaw[Z]: %d, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyro.dev.gyroADCRaw[X], gyro.dev.gyroADCRaw[Y], gyro.dev.gyroADCRaw[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
//			printf("MPU9250 (I2C) data - gyroADCCali[X]: %d, gyroADCCali[Y]: %d, gyroADCCali[Z]: %d, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyroADC[X], gyroADC[Y], gyroADC[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
//			printf("MPU9250 (I2C) data - gyroADCfiltered[X]: %.4f, gyroADCfiltered[Y]: %.4f, gyroADCfiltered[Z]: %.4f, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyro.gyroADCf[X], gyro.gyroADCf[Y], gyro.gyroADCf[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
		}else if (gyro.dev.mpuDetectionResult.sensor == MPU_9250_SPI && gyro.dev.calibrationFlag) {
//			printf("MPU9250 (SPI) data - gyroADCRaw[X]: %d, gyroADCRaw[Y]: %d, gyroADCRaw[Z]: %d, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyro.dev.gyroADCRaw[X], gyro.dev.gyroADCRaw[Y], gyro.dev.gyroADCRaw[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
//			printf("MPU9250 (SPI) data - gyroADCCali[X]: %d, gyroADCCali[Y]: %d, gyroADCCali[Z]: %d, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyroADC[X], gyroADC[Y], gyroADC[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
			printf("MPU9250 (SPI) data - gyroADCfiltered[X]: %.4f, gyroADCfiltered[Y]: %.4f, gyroADCfiltered[Z]: %.4f\r\n", gyro.gyroADCf[X], gyro.gyroADCf[Y], gyro.gyroADCf[Z]);
//			printf("MPU9250 (SPI) data - gyroADCfiltered[X]: %.4f, gyroADCfiltered[Y]: %.4f, gyroADCfiltered[Z]: %.4f, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyro.gyroADCf[X], gyro.gyroADCf[Y], gyro.gyroADCf[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
		}
//		printf("gyro.dev.gyroADCRaw[X]: %d, %s, %d\r\n", gyro.dev.gyroADCRaw[X], __FUNCTION__, __LINE__);
//		printf("gyro.dev.gyroADCRaw[Y]: %d, %s, %d\r\n", gyro.dev.gyroADCRaw[Y], __FUNCTION__, __LINE__);
//		printf("gyro.dev.gyroADCRaw[Z]: %d, %s, %d\r\n", gyro.dev.gyroADCRaw[Z], __FUNCTION__, __LINE__);
		delay(50);
#endif
		
