kyyang28/stm32_freertos_tasks/src/quad/target/12c-RTOS_TASKS/main.c
#if 0
		if (mpu_dmp_get_data(&pitch, &roll, &yaw) == 0) {
			/* Get raw data of MPU6050 (gyroscope, accelerometer, temperature) */
			MPU6050_Get_Gyroscope_Data(&gyro_x, &gyro_y, &gyro_z);
			MPU6050_Get_Accelerometer_Data(&acc_x, &acc_y, &acc_z);
			temp = MPU6050_Get_Temperature_Data();
			/* Send data to ANO flight controller software */
			mpu6050_send_data(acc_x, acc_y, acc_z, gyro_x, gyro_y, gyro_z);
			usart3_report_imu(acc_x, acc_y, acc_z, gyro_x, gyro_y, gyro_z, (int)(roll*100), (int)(pitch*100), (int)(yaw*10));
			/* Display on serial terminal */
//			printf("MPU6050 data - gyro_x: %d, gyro_y: %d, gyro_z: %d, acc_x: %d, acc_y: %d, acc_z: %d, temp: %.2f\r\n", gyro_x, gyro_y, gyro_z, acc_x, acc_y, acc_z, temp);
//			printf("Euler angles - roll: %.4f, pitch: %.4f, yaw: %.4f\r\n\r\n", roll, pitch, yaw);
//			delay(100);
		}else {
//			printf("mpu_dmp_get_data failed, %s, %d\r\n", __FUNCTION__, __LINE__);
//			delay(100);
		}
#endif

#if 0
		MPU6050_Get_Gyroscope_Data(&gyro_x, &gyro_y, &gyro_z);
		MPU6050_Get_Accelerometer_Data(&acc_x, &acc_y, &acc_z);
		temp = MPU6050_Get_Temperature_Data();
//		printf("MPU6050 gyro data: gyro_x: %d, gyro_y: %d, gyro_z: %d\r\n", gyro_x, gyro_y, gyro_z);
//		printf("MPU6050 temp data: %.2f\r\n", temp);
		printf("MPU6050 data - gyro_x: %d, gyro_y: %d, gyro_z: %d, acc_x: %d, acc_y: %d, acc_z: %d, temp: %.2f\r\n", gyro_x, gyro_y, gyro_z, acc_x, acc_y, acc_z, temp);		
		delay(100);
#endif

#if 0
		MPU9250_Get_Gyroscope_Data(&gyro_x, &gyro_y, &gyro_z);
		MPU9250_Get_Accelerometer_Data(&acc_x, &acc_y, &acc_z);
		temp = MPU9250_Get_Temperature_Data();
//		printf("MPU6050 gyro data: gyro_x: %d, gyro_y: %d, gyro_z: %d\r\n", gyro_x, gyro_y, gyro_z);
//		printf("MPU6050 temp data: %.2f\r\n", temp);
		printf("MPU9250 data - gyro_x: %d, gyro_y: %d, gyro_z: %d, acc_x: %d, acc_y: %d, acc_z: %d, temp: %.2f\r\n", gyro_x, gyro_y, gyro_z, acc_x, acc_y, acc_z, temp);		
		delay(100);
#endif

#if 0
//#ifdef USE_PWM			// USE_PWM is defined in target.h
		/* Testing USER button (PA0) high voltage level time period using TIM5 Input Capture mode
		 * Make sure to use the following uint32_t type for captures
		 * 	-- uint32_t captures[PWM_PORTS_OR_PPM_CAPTURE_COUNT];
		 *  -- static void pwmEdgeCallback(timerCCHandlerRec_t *cbRec, timCCR_t capture)
		 *  -- static void pwmOverflowCallback(timerOvrHandlerRec_t *cbRec, timCCR_t capture)
		 *  -- 	timCCR_t rise;				// timCCR_t is uint32_t
		 *  -- 	timCCR_t fall;				// timCCR_t is uint32_t
		 *  -- 	timCCR_t capture;				// timCCR_t is uint32_t
		 *  -- 	//	captureCompare_t rise;		// captureCompare_t is uint16_t
		 *  -- 	//	captureCompare_t fall;
		 *  -- 	//	captureCompare_t capture;
		 */
		delay(10);
//		printf("TIM_CAPTURE_STATUS: 0x%x, %s, %d\r\n", TIM_CAPTURE_STATUS, __FUNCTION__, __LINE__);
		if (TIM_CAPTURE_STATUS & 0x80) {			// check if the time period between the rising and falling edge of the signal is captured.
			/* print the time period */
			printf("The period of signal high: %u us\r\n", pwmRead(TIM_Channel_1));		// TIM_Channel_1 = 0x0
			TIM_CAPTURE_STATUS = 0x0;				// clear the status to zero for the next timer input capture
		}
		
		/* Testing USER button (PA0) high voltage level time period using TIM5 Input Capture mode */
//		delay(10);
//		if (TIM5_CH1_CAPTURE_STATUS & 0x80) {		// 0x80: 1 << 7 (capture successful)
//			printf("TIM5_CH1_CAPTURE_VAL: %u\r\n", TIM5_CH1_CAPTURE_VAL);
////			temp = TIM5_CH1_CAPTURE_STATUS & 0x3F;
////			temp *= 0xFFFFFFFF;						// sum of overflow value
//			temp += TIM5_CH1_CAPTURE_VAL;			// retrieve total time period of high voltage level
//			printf("HIGH: %lld us\r\n", temp);
//			TIM5_CH1_CAPTURE_STATUS = 0;			// clear capture status to enable the next input capture
//		}
	/* Testing USER button (PA0) high voltage level time period using TIM5 Input Capture mode */
#endif
		
		/* +----------------------------------------------------------------------------------------+ */
		/* +------------------------------- bus_i2c_soft API testing -------------------------------+ */
		/* +----------------------------------------------------------------------------------------+ */
//		flag = I2C_Start();			// test ok
//		printf("I2C_Start flag: %d, %s, %d\r\n", flag, __FUNCTION__, __LINE__);
//		I2C_Stop();					// test ok
//		I2C_Ack();					// test ok
//		I2C_NoAck();				// test ok
//		flag = I2C_WaitAck();		// test ok
//		printf("I2C_WaitAck flag: %d, %s, %d\r\n", flag, __FUNCTION__, __LINE__);
//		I2C_SendByte(0x59);			// test ok, sends 'Y'
		/* +----------------------------------------------------------------------------------------+ */
		/* +------------------------------- bus_i2c_soft API testing -------------------------------+ */
		/* +----------------------------------------------------------------------------------------+ */
		
//		IIC_Start();
//		delay(1000);

//		IIC_Stop();
//		delay(1000);

//		IIC_Ack();
//		delay(1000);
//		IIC_NAck();
//		delay(1000);
		
//		IIC_SCL = 0;
//		delay(500);
//		IIC_SCL = 1;
//		delay(500);
		
//		IIC_SDA = 0;
//		delay(800);
//		IIC_SDA = 1;
//		delay(800);

//		printf("STM32F407 by QUADYANG using USART3 Port\r\n");
//		delay(1000);
		
//		IOHi(g_sda);
//		IOHi(g_scl);
////		I2C_delay();
//		delay(500);
//		printf("sda: %d\r\n", IORead(g_sda));
		
//		IOHi(g_scl);
//		IOHi(g_sda);
//		delay(500);
//		printf("scl: %d\r\n", IORead(g_scl));
//		printf("sda: %d\r\n", IORead(g_sda));
//		IOLo(g_scl);
//		IOLo(g_sda);
//		delay(500);
//		printf("scl: %d\r\n", IORead(g_scl));
//		printf("sda: %d\r\n", IORead(g_sda));

//		IOHi(g_sda);
//		delay(500);
//		printf("sda: %d\r\n", IORead(g_sda));

//		IOLo(g_sda);
//		delay(500);
//		printf("sda: %d\r\n", IORead(g_sda));		
		
//		IOHi(g_sda);
//		IOHi(g_scl);
////		I2C_delay();
//		delay(1000);
//		sdaFlag = IORead(g_sda);
//		printf("sdaFlag: %d\r\n", sdaFlag);
		
